###################################################################
#Name          Brewfile
#Description   Global brew packages
#Author        Braydn Tanner
###################################################################

###################################################################
# GUI Applications
###################################################################

# Terminal
cask 'kitty'
cask 'warp'
cask 'iTerm2'

# Productivity
# cask 'bitwarden' Intentionally commented. Needs to be installed from App Store for touch ID. 
cask 'amethyst'
cask 'maccy'
cask 'brave-browser'
cask 'google-chrome'
cask 'firefox'
cask 'zen'
cask 'slack'
cask 'orion'
cask 'spotify'
cask 'scroll-reverser'
cask 'hammerspoon'
cask 'karabiner-elements'
cask 'tailscale-app'
cask 'background-music'
brew 'pomatez'

# Code
cask 'docker-desktop'
cask 'visual-studio-code'
cask 'tableplus'
cask 'postman'
cask 'gpg-suite-no-mail'
cask 'neovide-app'


###################################################################
# Shell Tools
###################################################################

brew 'vim'
brew 'neovim'
brew 'eza'
brew 'bat'
brew 'ripgrep'
brew 'fzf'
brew 'fd'
brew 'entr'
brew 'jq'
brew 'yq'
brew 'aspell' # spell checker
brew 'wget'
brew 'tmux'
brew 'gawk'
brew 'git-delta'
brew 'htop'
brew 'pandoc'
brew 'speedtest-cli'
brew 'tldr' # tldr of the man pages
brew 'tree'
brew 'direnv'
brew 'nvm'
brew 'lazygit'

###################################################################
# Dev Tools
###################################################################

brew 'stylua'
brew 'fsouza/prettierd/prettierd'
brew 'shellcheck' # shell script linting
brew 'shfmt' # shell script formatting

###################################################################
# Utilities
###################################################################

brew 'kind'
brew 'kubectx'
brew 'bitwarden-cli'
brew 'awscli'
brew 'kubent'

###################################################################
# Languages
###################################################################

brew 'go'
# brew 'golangci-lint'
# brew 'pyenv'
# brew 'rbenv'
# brew 'cmake'

###################################################################
# Fonts
tap 'homebrew/cask-fonts'
cask 'font-hack-nerd-font'
